[
  {
    "page_number": 1,
    "summary": "This page contains terms regarding insurance coverage and limitations due to protective safeguard failures.",
    "full_text": "With respect to “P-3”, “P-7”and “P-15”, we will not pay for loss or damage caused by or resulting from vandalism, burglary, theft or any other act of stealing if, prior to the vandalism, burglary, theft or any other act of stealing, you: a. Knew of any suspension or impairment in any protective safeguard listed in the Schedule above and failed to notify us of that fact; or b. Failed to maintain any protective safeguard listed in the Schedule above, and over which you had control, in complete working order. With respect to “P-6” and “P-8” we will not pay for loss or damage caused by or resulting from “equipment breakdown”, electrical disturbance or expediting expenses as a result of an electrical disturbance if, prior to the “equipment breakdown” you: a. Knew of any suspension or impairment in any protective safeguard listed in the Schedule above and failed to notify us of that fact; or b. Failed to maintain any protective safeguard listed in the Schedule above, and over which you had control, in complete working order. With respect to “P-9” we will not pay for loss or damage caused by or resulting from “equipment breakdown”, spoilage or expediting expenses as a result of spoilage if, prior to the “equipment breakdown” you: a. Knew of any suspension or impairment in any protective safeguard listed in the Schedule above and failed to notify us of that fact; or b. Failed to maintain any protective safeguard listed in the Schedule above, and over which you had control, in complete working order. With respect to “P-21” we will not pay for loss or damage caused by or resulting from fire, vandalism, burglary, theft or any other act of stealing, “equipment breakdown”, electrical disturbance or expediting expenses as a result of an electrical disturbance, “equipment breakdown”, spoilage or expediting expenses as a result of spoilage, as applicable, if you: a. Knew of any suspension or impairment in any protective safeguard listed in the Schedule above and failed to notify us of that fact; or b. Failed to maintain any protective safeguard listed in the Schedule above, and over which you had control, in complete working order. All other terms and conditions of this policy remain unchanged. This endorsement is a part of your policy and takes effect on the effective date of your policy unless another effective date is shown.",
    "tables_and_figures": [],
    "key_information": {
      "insured_property": null,
      "coverage_details": "Exclusion of coverage due to vandalism, burglary, equipment breakdown, and other incidents if protective safeguards fail.",
      "dates": "Effective Date: 10/05/2024",
      "amounts": null,
      "addresses": "807 Broadway St NE, Minneapolis, MN 55413"
    },
    "relationships": {
      "continues_from_previous": null,
      "continues_to_next": null,
      "references": "Protective safeguard-related conditions"
    },
    "document_structure": {
      "section_title": "Protective Safeguards Endorsement Details",
      "subsections": [],
      "page_type": "content"
    },
    "analyzed_at": "2025-08-24T16:03:53.585816"
  },
  {
    "page_number": 2,
    "summary": "Continuation of protective safeguard-related insurance limitations and endorsement details.",
    "full_text": "807 BROADWAY REVIVAL, LLC AND HILLCREST DEVELOPMENT, LLLP 2424 KENNEDY ST NE MINNEAPOLIS, MN 55413 10/05/2024Effective Date: Name of Person or Organization: Schedule: (If no entry appears above, the information required to complete this endorsement will be shown in the Declarations as applicable to this endorsement) SECTION III - COMMON POLICY CONDITIONS, Paragraph H. OTHER INSURANCE, is amended with the addition of the following: The coverage afforded by this policy to the person(s) or organization(s) listed above is primary and non-contributory if: 1. This insurance is required to be primary or non-contributory under a written contract: and 2. The loss to be covered occurs on or after the effective date of the written contract; and 3. The person or organization shown in the Schedule is also an insured, but only with respect to liability arising out of the ownership, maintenance or use that part of the premises leased to you and shown in the Schedule. B. The following exclusions are added to Section II - Liability: This insurance does not apply to: 1. Any “occurrence” that takes place after you cease to be a tenant in the premises described in the Schedule 2. Structural alterations, new construction or demolition operations performed by or for the person or organization designated in the Schedule",
    "tables_and_figures": [],
    "key_information": {
      "insured_property": null,
      "coverage_details": "Primary and non-contributory insurance, exclusions on leased premises.",
      "dates": "Effective Date: 10/05/2024",
      "amounts": null,
      "addresses": "350 South 5th Street, Minneapolis, MN 55415"
    },
    "relationships": {
      "continues_from_previous": null,
      "continues_to_next": null,
      "references": "Primary and non-contributory clauses"
    },
    "document_structure": {
      "section_title": "Common Policy Conditions and Liability Exclusions",
      "subsections": [],
      "page_type": "content"
    },
    "analyzed_at": "2025-08-24T16:03:53.585846"
  },
  {
    "page_number": 3,
    "summary": "Insurance policy renewal details and premium breakdown for Businessowners coverage.",
    "full_text": "FORM OF BUSINESS: Non-Profit Corporation BUSINESS DESCRIPTION: Non-Profit Directors and Officers 12:01 A.M. STANDARD TIME AT YOUR MAILING ADDRESS SHOWN ABOVE IN CONSIDERATION OF THE RENEWAL PREMIUM STATED BELOW, EXPIRING POLICY NUMBER NBP1555904F IS RENEWED THIS POLICY CONSISTS OF THE FOLLOWING COVERAGE PARTS FOR WHICH A PREMIUM IS INDICATED. NAMED INSURED AND ADDRESS: LOGAN PARK NEIGHBORHOOD ASSOCIATION 807 BROADWAY ST NE, STE 70 MINNEAPOLIS, MN 55413 Renewal of Number POLICY DECLARATIONS 10/05/2024 10/05/2025 Non-Profit Corporation Non-Profit Directors and Officers *** RENEWAL CERTIFICATE *** United States Liability Insurance Company 1190 Devon Park Drive, Wayne, Pennsylvania 19087 A Member Company of United States Liability Insurance Group Agent: TWIN CITY GROUP (4317) 4500 Park Glen Road, Suite 400 Minneapolis, MN 55416 Issued: 08/23/2024 1:53 PM By: THIS PREMIUM MAY BE SUBJECT TO ADJUSTMENT. Direct Bill Policy FOR THE POLICY PERIOD STATED ABOVE. PLEASE ATTACH THIS RENEWAL CERTIFICATE TO YOUR EXPIRING POLICY. PREMIUM Businessowners Liability Coverage Part $411.00 Businessowners Property Coverage Part $50.00 Fire Safety Surcharge $0.33 TOTAL: $461.33 UPC (08-07) THESE DECLARATIONS TOGETHER WITH...",
    "tables_and_figures": [],
    "key_information": {
      "insured_property": null,
      "coverage_details": "Non-profit Director and Officer liability coverage.",
      "dates": "Policy Period: 10/05/2024 - 10/05/2025",
      "amounts": "Total Premium: $461.33",
      "addresses": "Logged in above as Named Insured address."
    },
    "relationships": {
      "continues_from_previous": null,
      "continues_to_next": null,
      "references": "Policy renewal for NBP1555904F"
    },
    "document_structure": {
      "section_title": "Policy Declarations",
      "subsections": [],
      "page_type": "content"
    },
    "analyzed_at": "2025-08-24T16:03:53.585851"
  },
  {
    "page_number": 4,
    "summary": "Detailed declarations for general liability coverage part with premium calculations.",
    "full_text": "49950 1 Per Additional Insured 0.000 50.000 $0 $50 1 Primary and Non-Contributory - Written Contract 44448 1 Person Or Organization 0.000 50.000 $0 $50 MINIMUM PREMIUM FOR GENERAL LIABILITY COVERAGE PART: $345 TOTAL PREMIUM FOR GENERAL LIABILITY COVERAGE PART: (This Premium may be subject to adjustment.) $411 MP - minimum premium NBP1555904G BUSINESSOWNERS GENERAL LIABILITY COVERAGE PART DECLARATIONS Effective Date: 10/05/2024 12:01 STANDARD TIME Policy No. Copyright, ISO Commercial Risk Services, Inc., 1983, 1984, 1988 Includes copyrighted material of ISO Commercial Risk Services, Inc., with its permission. THESE DECLARATIONS ARE PART OF THE POLICY DECLARATIONS CONTAINING THE NAME OF THE INSURED AND THE POLICY PERIOD. BPL150 (02/09) Page 1 Of 1 This page has been intentionally left blank. PROTECTIVE DEVICES OR SERVICES PROVISIONS SCHEDULE The following is added to the policy: A. Protective Safeguards 1. You are required to have and maintain the protective devices or services listed in the Schedule...",
    "tables_and_figures": [],
    "key_information": {
      "insured_property": null,
      "coverage_details": "General Liability Coverage details with premium computations.",
      "dates": "Effective Date: 10/05/2024",
      "amounts": "Minimum Premium: $345, Total Premium: $411",
      "addresses": null
    },
    "relationships": {
      "continues_from_previous": null,
      "continues_to_next": null,
      "references": "General Liability Coverage Part provisions"
    },
    "document_structure": {
      "section_title": "General Liability Coverage Declarations",
      "subsections": [],
      "page_type": "content"
    },
    "analyzed_at": "2025-08-24T16:03:53.585855"
  },
  {
    "page_number": 5,
    "summary": "A comprehensive list of endorsements and exclusions applicable to the insurance policy.",
    "full_text": "BP-97 Exclusion For Event Vendor/Exhibitor & Contractor05/07 BP0003 Businessowners Coverage Form01/10 BP0125 Minnesota Changes01/10 BP0402 Additional Insured - Managers Or Lessors Of Premises01/06 BP0417 Employment-Related Practices Exclusion01/10 BP0448 Additional Insured - Designated Person Or Organization01/06 BP0497 Waiver Of Transfer Of Rights Of Recovery Against Others To Us01/06 BP1505 Exclusion - Access Or Disclosure Of Confidential Or Personal Information And Data -Related Liability - Limited Bodily Injury Exception Not Included 05/14 BP1560 Cyber Incident Exclusion02/21 FORMS AND ENDORSEMENTS EXTENSION OF DECLARATIONS Policy No. NBP1555904G Effective Date: 10/05/2024 12:01 AM STANDARD TIME AT YOUR MAILING ADDRESS All other terms and conditions remain unchanged.EOD (01/95) Page of1 2 Endorsements marked with an asterisk (*) have been added to this policy or have a new edition date and are attached with this certificate.",
    "tables_and_figures": [],
    "key_information": {
      "insured_property": null,
      "coverage_details": null,
      "dates": "Effective Date: 10/05/2024",
      "amounts": null,
      "addresses": null
    },
    "relationships": {
      "continues_from_previous": null,
      "continues_to_next": null,
      "references": "List of Form and Endorsement"
    },
    "document_structure": {
      "section_title": "Forms and Endorsements",
      "subsections": [],
      "page_type": "content"
    },
    "analyzed_at": "2025-08-24T16:03:53.585859"
  }
]