[
  {
    "page_number": 1,
    "summary": "This page outlines insurance coverages, including liability limits and business property details for 807 Broadway St Ne, Minneapolis. It specifies deductible amounts and the frame construction type of the premises.",
    "full_text": "DESCRIPTION OF PREMISES Prem Bldg Location, Construction, Occupancy and Other Information Territory Fire Code 1 807 Broadway St Ne, Minneapolis, MN 55413 Covered Causes of Loss: Special Construction: Frame 1 Protection Class 6 001 0757 Description: Non-Profit Directors and Officers Square Footage: Special Deductible: None Special Deductible Type: Coinsurance % or Monthly Indemnity Limits of Insurance COVERAGES PROVIDED - INSURANCE AT THE DESCRIBED PREMISES APPLIES ONLY FOR COVERAGES FOR WHICH A LIMIT OF INSURANCE IS SHOWN Prem Bldg Coverage + Valuation PremiumDeductible 1 1 Business Income and Extra Expense $16,552 $0 Included 1 1 Business Personal Property $5,000 $1,000 RC Included MINIMUM PREMIUM FOR PROPERTY COVERAGE PART: $50 TOTAL PREMIUM FOR PROPERTY COVERAGE PART: MP - minimum premium + Valuation: ACV - Actual Cash Value; RC - Replacement Cost; RC/ACV - Replacement Cost/ACV Roof FBV - Functional Building Value; AA - Agreed Amount; ALS - Actual Loss Sustained $50 MP 12:01 STANDARD TIME 10/05/2024 Effective Date: NBP1555904G BUSINESSOWNERS PROPERTY COVERAGE PART DECLARATIONS Policy No. Copyright, ISO Commercial Risk Services, Inc., 1983, 1984, 1988 Includes copyrighted material of ISO Commercial Risk Services, Inc., with its permission. THESE DECLARATIONS ARE PART OF THE POLICY DECLARATIONS CONTAINING THE NAME OF THE INSURED AND THE POLICY PERIOD. BPP150 (02/09) Page 1 Of 1 LOSS PAYABLE(S): NONE See Endorsement EOD (01/95) Coverage Form(s)/Part(s) and Endorsement(s) made a part of this policy at time of issue: Coverage Form(s)/Part(s) and Endorsement(s) made a part of this policy at time of issue: See Form EOD (01/95) LIMITS OF INSURANCE Liability and Medical Expenses $1,000,000 Medical Expense (per person) $5,000 Damages To Premises Rented To You (Any One Premises) $100,000 LIABILITY DEDUCTIBLE $0 An Aggregate Limit of Liability applies to this Coverage as defined in SECTION II - LIABILITY, paragraph D.4. of the Businessowners Coverage Form. LOCATIONS OF ALL PREMISES YOU OWN, RENT OR OCCUPY Location Address Territory 1 807 Broadway St Ne, Minneapolis, MN 55413 001 PREMIUM COMPUTATION Rate Advance Premium Loc Classification Code No. Premium Basis Pr/Co All Other Pr/Co All Other 1 Membership Organization (Charity) - no premises owned or leased - Not-for-Profit only 41670 14 Per Members 0.000 1.482 $0 $21 1 Waiver of Rights of Recovery 49956 If Any 0.000 0.000 Included Included 1 Additional Insured - Designated Person 49950 1 Per Additional Insured 0.000 50.000 $0 $50 1 Blanket Special Events Liability - Non-Profit Organizations 00041 Flat 0.000 240.000 $0 $240 1 Additional Insured - Managers or Lessors of Premises 49950 1 Per Additional Insured 0.000 50.000 $0 $50",
    "tables_and_figures": [
      {
        "type": "table",
        "description": "Table of coverages and premiums for the premises at 807 Broadway St Ne.",
        "content": "Prem Bldg Location, Construction, Occupancy and Other Information Territory Fire Code... Coverages Provided... Premium Computation: Classification Code, Rate, Premium Basis."
      }
    ],
    "key_information": {
      "insured_property": "807 Broadway St Ne, Minneapolis, MN 55413",
      "coverage_details": "Business Income and Extra Expense $16,552; Business Personal Property $5,000",
      "dates": "Effective Date: 10/05/2024",
      "amounts": "Liability and Medical Expenses $1,000,000; Medical Expense (per person) $5,000",
      "addresses": "807 Broadway St Ne, Minneapolis, MN 55413"
    },
    "relationships": {
      "continues_from_previous": "None indicated.",
      "continues_to_next": "The document continues with additional policy details and endorsements.",
      "references": "See Endorsement EOD (01/95) for additional details."
    },
    "document_structure": {
      "section_title": "Businessowners Property Coverage Part Declarations",
      "subsections": [
        "Description of Premises",
        "Coverage Details",
        "Premium Computation"
      ],
      "page_type": "content"
    },
    "analyzed_at": "2025-08-24T16:05:09.451814"
  },
  {
    "page_number": 2,
    "summary": "The page discusses the liability aspects related to the policy, specifically focusing on exclusions related to terrorism and property safeguards.",
    "full_text": "PAGE 2 CONTENT: Section II – Liability is amended as follows: A. The following is added to Paragraph B. Exclusions: This insurance does not apply to: Perfluoroalkyl And Polyfluoroalkyl Substances a. 'Bodily injury' or 'property damage' which would not have occurred, or 'personal and advertising injury' which would not have taken place, in whole or in part, but for the actual, alleged, threatened or suspected inhalation, ingestion, absorption, consumption, discharge, dispersal, seepage, migration, release or escape of, contact with, exposure to, existence of, or presence of, any 'perfluoroalkyl or polyfluoroalkyl substances'. b. Any loss, cost or expense arising, in whole or in part, out of the abating, testing for, monitoring, cleaning up, removing, containing, treating, detoxifying, neutralizing, remediating or disposing of, or in any way responding to or assessing the effects of, 'perfluoroalkyl or polyfluoroalkyl substances', by any insured or by any other person or entity. B. The following is added to Paragraph F. Liability And Medical Expenses Definitions: 'Perfluoroalkyl or polyfluoroalkyl substances' means any: 1. Chemical or substance that contains one or more alkyl carbons on which hydrogen atoms have been partially or completely replaced by fluorine atoms, including but not limited to: a. Polymer, oligomer, monomer or nonpolymer chemicals and their homologues, isomers, telomers, salts, derivatives, precursor chemicals, degradation products or by-products; b. Perfluoroalkyl acids (PFAA), such as perfluorooctanoic acid (PFOA) and its salts, or perfluorooctane sulfonic acid (PFOS) and its salts; c. Perfluoropolyethers (PFPE); d. Fluorotelomer-based substances; or e. Side-chain fluorinated polymers; or 2. Good or product, including containers, materials, parts or equipment furnished in connection with such goods or products, that consists of or contains any chemical or substance described in Paragraph B.1.",
    "tables_and_figures": [],
    "key_information": {
      "insured_property": null,
      "coverage_details": "Exclusion on Perfluoroalkyl And Polyfluoroalkyl Substances",
      "dates": null,
      "amounts": null,
      "addresses": null
    },
    "relationships": {
      "continues_from_previous": "Details of exclusions and policy amendments related to PFAS.",
      "continues_to_next": "Further details on definitions and exclusions are expected.",
      "references": "Section II - Liability; Specific substances and exclusions listed."
    },
    "document_structure": {
      "section_title": "Exclusions and Amendments",
      "subsections": [
        "Exclusions Related to PFAS",
        "Definitions of PFAS"
      ],
      "page_type": "content"
    },
    "analyzed_at": "2025-08-24T16:05:09.451859"
  }
]